FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    else if( TIMx == TIM9 )
    {
        RCC_APB2PeriphResetCmd( RCC_APB2Periph_TIM9, ENABLE );
        RCC_APB2PeriphResetCmd( RCC_APB2Periph_TIM9, DISABLE );
    }
    else if( TIMx == TIM10 )
    {
        RCC_APB2PeriphResetCmd( RCC_APB2Periph_TIM10, ENABLE );
        RCC_APB2PeriphResetCmd( RCC_APB2Periph_TIM10, DISABLE );
    }
    else
    {
        if( TIMx == TIM11 )
        {
            RCC_APB2PeriphResetCmd( RCC_APB2Periph_TIM11, ENABLE );
            RCC_APB2PeriphResetCmd( RCC_APB2Periph_TIM11, DISABLE );
        }
    }
}

/**
 * @brief  Initializes the TIMx Time Base Unit peripheral according to
 *         the specified parameters in the TIM_TimeBaseInitStruct.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_TimeBaseInitStruct: pointer to a TIM_TimeBaseInitTypeDef
 *         structure that contains the configuration information for
 *         the specified TIM peripheral.
 * @retval None
 */
void TIM_TimeBaseInit( TIM_TypeDef * TIMx,
                       TIM_TimeBaseInitTypeDef * TIM_TimeBaseInitStruct )
{
    uint16_t tmpcr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_COUNTER_MODE( TIM_TimeBaseInitStruct->TIM_CounterMode ) );
    assert_param( IS_TIM_CKD_DIV( TIM_TimeBaseInitStruct->TIM_ClockDivision ) );

    tmpcr1 = TIMx->CR1;

    if( ( ( TIMx ) == TIM2 ) || ( ( TIMx ) == TIM3 ) || ( ( TIMx ) == TIM4 ) || ( ( TIMx ) == TIM5 ) )
    {
        /* Select the Counter Mode */
        tmpcr1 &= ( uint16_t ) ( ~( ( uint16_t ) ( TIM_CR1_DIR | TIM_CR1_CMS ) ) );
        tmpcr1 |= ( uint32_t ) TIM_TimeBaseInitStruct->TIM_CounterMode;
    }

    if( ( ( TIMx ) != TIM6 ) && ( ( TIMx ) != TIM7 ) )
    {
        /* Set the clock division */
        tmpcr1 &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CR1_CKD ) );
        tmpcr1 |= ( uint32_t ) TIM_TimeBaseInitStruct->TIM_ClockDivision;
    }

    TIMx->CR1 = tmpcr1;

    /* Set the Autoreload value */
    TIMx->ARR = TIM_TimeBaseInitStruct->TIM_Period;

    /* Set the Prescaler value */
    TIMx->PSC = TIM_TimeBaseInitStruct->TIM_Prescaler;

    /* Generate an update event to reload the Prescaler value immediatly */
    TIMx->EGR = TIM_PSCReloadMode_Immediate;
}

/**
 * @brief  Fills each TIM_TimeBaseInitStruct member with its default value.
 * @param  TIM_TimeBaseInitStruct : pointer to a TIM_TimeBaseInitTypeDef
 *         structure which will be initialized.
 * @retval None
 */
void TIM_TimeBaseStructInit( TIM_TimeBaseInitTypeDef * TIM_TimeBaseInitStruct )
{
    /* Set the default configuration */
    TIM_TimeBaseInitStruct->TIM_Period = 0xFFFFFFFF;
    TIM_TimeBaseInitStruct->TIM_Prescaler = 0x0000;
    TIM_TimeBaseInitStruct->TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStruct->TIM_CounterMode = TIM_CounterMode_Up;
}

/**
 * @brief  Configures the TIMx Prescaler.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  Prescaler: specifies the Prescaler Register value.
 * @param  TIM_PSCReloadMode: specifies the TIM Prescaler Reload mode
 *   This parameter can be one of the following values:
 *     @arg TIM_PSCReloadMode_Update: The Prescaler is loaded at the update event.
 *     @arg TIM_PSCReloadMode_Immediate: The Prescaler is loaded immediatly.
 * @retval None
 */
void TIM_PrescalerConfig( TIM_TypeDef * TIMx,
                          uint16_t Prescaler,
                          uint16_t TIM_PSCReloadMode )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_PRESCALER_RELOAD( TIM_PSCReloadMode ) );

    /* Set the Prescaler value */
    TIMx->PSC = Prescaler;
    /* Set or reset the UG Bit */
    TIMx->EGR = TIM_PSCReloadMode;
}

/**
 * @brief  Specifies the TIMx Counter Mode to be used.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_CounterMode: specifies the Counter Mode to be used
 *   This parameter can be one of the following values:
 *     @arg TIM_CounterMode_Up: TIM Up Counting Mode.
 *     @arg TIM_CounterMode_Down: TIM Down Counting Mode.
 *     @arg TIM_CounterMode_CenterAligned1: TIM Center Aligned Mode1.
 *     @arg TIM_CounterMode_CenterAligned2: TIM Center Aligned Mode2.
 *     @arg TIM_CounterMode_CenterAligned3: TIM Center Aligned Mode3.
 * @retval None
 */
void TIM_CounterModeConfig( TIM_TypeDef * TIMx,
                            uint16_t TIM_CounterMode )
{
    uint16_t tmpcr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_COUNTER_MODE( TIM_CounterMode ) );

    tmpcr1 = TIMx->CR1;
    /* Reset the CMS and DIR Bits */
    tmpcr1 &= ( uint16_t ) ( ~( ( uint16_t ) ( TIM_CR1_DIR | TIM_CR1_CMS ) ) );
    /* Set the Counter Mode */
    tmpcr1 |= TIM_CounterMode;
    /* Write to TIMx CR1 register */
    TIMx->CR1 = tmpcr1;
}

/**
 * @brief  Sets the TIMx Counter Register value
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  Counter: specifies the Counter register new value.
 * @retval None
 */
void TIM_SetCounter( TIM_TypeDef * TIMx,
                     uint32_t Counter )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );

    /* Set the Counter Register value */
    TIMx->CNT = Counter;
}

/**
 * @brief  Sets the TIMx Autoreload Register value
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  Autoreload: specifies the Autoreload register new value.
 * @retval None
 */
void TIM_SetAutoreload( TIM_TypeDef * TIMx,
                        uint32_t Autoreload )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );

    /* Set the Autoreload Register value */
    TIMx->ARR = Autoreload;
}

/**
 * @brief  Gets the TIMx Counter value.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @retval Counter Register value.
 */
uint32_t TIM_GetCounter( TIM_TypeDef * TIMx )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );

    /* Get the Counter Register value */
    return TIMx->CNT;
}

/**
 * @brief  Gets the TIMx Prescaler value.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @retval Prescaler Register value.
 */
uint16_t TIM_GetPrescaler( TIM_TypeDef * TIMx )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );

    /* Get the Prescaler Register value */
    return TIMx->PSC;
}

/**
 * @brief  Enables or Disables the TIMx Update event.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  NewState: new state of the TIMx UDIS bit
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_UpdateDisableConfig( TIM_TypeDef * TIMx,
                              FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Set the Update Disable Bit */
        TIMx->CR1 |= TIM_CR1_UDIS;
    }
    else
    {
        /* Reset the Update Disable Bit */
        TIMx->CR1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR1_UDIS );
    }
}

/**
 * @brief  Configures the TIMx Update Request Interrupt source.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_UpdateSource: specifies the Update source.
 *   This parameter can be one of the following values:
 *     @arg TIM_UpdateSource_Global: Source of update is the counter overflow/underflow
 *                                     or the setting of UG bit, or an update generation
 *                                     through the slave mode controller.
 *     @arg TIM_UpdateSource_Regular: Source of update is counter overflow/underflow.
 * @retval None
 */
void TIM_UpdateRequestConfig( TIM_TypeDef * TIMx,
                              uint16_t TIM_UpdateSource )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_UPDATE_SOURCE( TIM_UpdateSource ) );

    if( TIM_UpdateSource != TIM_UpdateSource_Global )
    {
        /* Set the URS Bit */
        TIMx->CR1 |= TIM_CR1_URS;
    }
    else
    {
        /* Reset the URS Bit */
        TIMx->CR1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR1_URS );
    }
}

/**
 * @brief  Enables or disables TIMx peripheral Preload register on ARR.
 * @param  TIMx: where x can be  2 to 11 to select the TIM peripheral.
 * @param  NewState: new state of the TIMx peripheral Preload register
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_ARRPreloadConfig( TIM_TypeDef * TIMx,
                           FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Set the ARR Preload Bit */
        TIMx->CR1 |= TIM_CR1_ARPE;
    }
    else
    {
        /* Reset the ARR Preload Bit */
        TIMx->CR1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR1_ARPE );
    }
}

/**
 * @brief  Selects the TIMx's One Pulse Mode.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_OPMode: specifies the OPM Mode to be used.
 *   This parameter can be one of the following values:
 *     @arg TIM_OPMode_Single:: TIM One Pulse Single Mode (Counter stops counting
 *                              at the next update event (clearing the bit CEN)).
 *     @arg TIM_OPMode_Repetitive: TIM One Pulse Repetitive Mode
 *                                 (Counter is not stopped at update event).
 * @retval None
 */
void TIM_SelectOnePulseMode( TIM_TypeDef * TIMx,
                             uint16_t TIM_OPMode )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_OPM_MODE( TIM_OPMode ) );

    /* Reset the OPM Bit */
    TIMx->CR1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR1_OPM );
    /* Configure the OPM Mode */
    TIMx->CR1 |= TIM_OPMode;
}

/**
 * @brief  Sets the TIMx Clock Division value.
 * @param  TIMx: where x can be  2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_CKD: specifies the clock division value.
 *   This parameter can be one of the following value:
 *     @arg TIM_CKD_DIV1: TDTS = Tck_tim.
 *     @arg TIM_CKD_DIV2: TDTS = 2*Tck_tim.
 *     @arg TIM_CKD_DIV4: TDTS = 4*Tck_tim.
 * @retval None
 */
void TIM_SetClockDivision( TIM_TypeDef * TIMx,
                           uint16_t TIM_CKD )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_CKD_DIV( TIM_CKD ) );

    /* Reset the CKD Bits */
    TIMx->CR1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR1_CKD );
    /* Set the CKD value */
    TIMx->CR1 |= TIM_CKD;
}

/**
 * @brief  Enables or disables the specified TIM peripheral.
 * @param  TIMx: where x can be 2 to 11 to select the TIMx peripheral.
 * @param  NewState: new state of the TIMx peripheral.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_Cmd( TIM_TypeDef * TIMx,
              FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Enable the TIM Counter */
        TIMx->CR1 |= TIM_CR1_CEN;
    }
    else
    {
        /* Disable the TIM Counter */
        TIMx->CR1 &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CR1_CEN ) );
    }
}

/**
 * @}
 */

/** @defgroup TIM_Group2 Output Compare management functions
 *  @brief    Output Compare management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Output Compare management functions #####
 #####===============================================================================
 *** TIM Driver: how to use it in Output Compare Mode ***
 ***===============================================================================
 ***[..] To use the Timer in Output Compare mode, the following steps are mandatory:
 ***     (#) Enable TIM clock using
 ***         RCC_APBxPeriphClockCmd(RCC_APBxPeriph_TIMx, ENABLE) function.
 ***     (#) Configure the TIM pins by configuring the corresponding GPIO pins
 ***     (#) Configure the Time base unit as described in the first part of this
 ***         driver, if needed, else the Timer will run with the default
 ***         configuration:
 ***         (++) Autoreload value = 0xFFFF.
 ***         (++) Prescaler value = 0x0000.
 ***         (++) Counter mode = Up counting.
 ***         (++) Clock Division = TIM_CKD_DIV1.
 ***     (#) Fill the TIM_OCInitStruct with the desired parameters including:
 ***         (++) The TIM Output Compare mode: TIM_OCMode.
 ***         (++) TIM Output State: TIM_OutputState.
 ***         (++) TIM Pulse value: TIM_Pulse.
 ***         (++) TIM Output Compare Polarity : TIM_OCPolarity.
 ***     (#) Call TIM_OCxInit(TIMx, &TIM_OCInitStruct) to configure the desired
 ***         channel with the corresponding configuration.
 ***     (#) Call the TIM_Cmd(ENABLE) function to enable the TIM counter.
 ***[..]
 ***    (@) All other functions can be used separately to modify, if needed,
 ***      a specific feature of the Timer.
 ***    (@) In case of PWM mode, this function is mandatory:
 ***        TIM_OCxPreloadConfig(TIMx, TIM_OCPreload_ENABLE).
 ***    (@) If the corresponding interrupt or DMA request are needed, the user should:
 ***        (#@) Enable the NVIC (or the DMA) to use the TIM interrupts (or DMA requests).
 ***        (#@) Enable the corresponding interrupt (or DMA request) using the function
 ***             TIM_ITConfig(TIMx, TIM_IT_CCx) (or TIM_DMA_Cmd(TIMx, TIM_DMA_CCx)).
 ***
 ***@endverbatim
 * @{
 */

/**
 * @brief  Initializes the TIMx Channel1 according to the specified
 *         parameters in the TIM_OCInitStruct.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure
 *         that contains the configuration information for the specified TIM
 *         peripheral.
 * @retval None
 */
void TIM_OC1Init( TIM_TypeDef * TIMx,
                  TIM_OCInitTypeDef * TIM_OCInitStruct )
{
    uint16_t tmpccmrx = 0, tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_MODE( TIM_OCInitStruct->TIM_OCMode ) );
    assert_param( IS_TIM_OUTPUT_STATE( TIM_OCInitStruct->TIM_OutputState ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCInitStruct->TIM_OCPolarity ) );
    /* Disable the Channel 1: Reset the CC1E Bit */
    TIMx->CCER &= ( uint16_t ) ( ~( uint16_t ) TIM_CCER_CC1E );

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Get the TIMx CCMR1 register value */
    tmpccmrx = TIMx->CCMR1;

    /* Reset the Output Compare Mode Bits */
    tmpccmrx &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCMR1_OC1M ) );
    tmpccmrx &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCMR1_CC1S ) );

    /* Select the Output Compare Mode */
    tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;

    /* Reset the Output Polarity level */
    tmpccer &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCER_CC1P ) );
    /* Set the Output Compare Polarity */
    tmpccer |= TIM_OCInitStruct->TIM_OCPolarity;

    /* Set the Output State */
    tmpccer |= TIM_OCInitStruct->TIM_OutputState;

    /* Set the Capture Compare Register value */
    TIMx->CCR1 = TIM_OCInitStruct->TIM_Pulse;

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Initializes the TIMx Channel2 according to the specified
 *         parameters in the TIM_OCInitStruct.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure
 *         that contains the configuration information for the specified TIM
 *         peripheral.
 * @retval None
 */
void TIM_OC2Init( TIM_TypeDef * TIMx,
                  TIM_OCInitTypeDef * TIM_OCInitStruct )
{
    uint16_t tmpccmrx = 0, tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_MODE( TIM_OCInitStruct->TIM_OCMode ) );
    assert_param( IS_TIM_OUTPUT_STATE( TIM_OCInitStruct->TIM_OutputState ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCInitStruct->TIM_OCPolarity ) );
    /* Disable the Channel 2: Reset the CC2E Bit */
    TIMx->CCER &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCER_CC2E ) );

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Get the TIMx CCMR1 register value */
    tmpccmrx = TIMx->CCMR1;

    /* Reset the Output Compare Mode Bits */
    tmpccmrx &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCMR1_OC2M ) );

    /* Select the Output Compare Mode */
    tmpccmrx |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OCMode << 8 );

    /* Reset the Output Polarity level */
    tmpccer &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCER_CC2P ) );
    /* Set the Output Compare Polarity */
    tmpccer |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OCPolarity << 4 );

    /* Set the Output State */
    tmpccer |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OutputState << 4 );

    /* Set the Capture Compare Register value */
    TIMx->CCR2 = TIM_OCInitStruct->TIM_Pulse;

    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Initializes the TIMx Channel3 according to the specified
 *         parameters in the TIM_OCInitStruct.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure
 *         that contains the configuration information for the specified TIM
 *         peripheral.
 * @retval None
 */
void TIM_OC3Init( TIM_TypeDef * TIMx,
                  TIM_OCInitTypeDef * TIM_OCInitStruct )
{
    uint16_t tmpccmrx = 0, tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_MODE( TIM_OCInitStruct->TIM_OCMode ) );
    assert_param( IS_TIM_OUTPUT_STATE( TIM_OCInitStruct->TIM_OutputState ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCInitStruct->TIM_OCPolarity ) );

    /* Disable the Channel 2: Reset the CC2E Bit */
    TIMx->CCER &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCER_CC3E ) );

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Get the TIMx CCMR2 register value */
    tmpccmrx = TIMx->CCMR2;

    /* Reset the Output Compare Mode Bits */
    tmpccmrx &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCMR2_OC3M ) );

    /* Select the Output Compare Mode */
    tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;

    /* Reset the Output Polarity level */
    tmpccer &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCER_CC3P ) );
    /* Set the Output Compare Polarity */
    tmpccer |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OCPolarity << 8 );

    /* Set the Output State */
    tmpccer |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OutputState << 8 );

    /* Set the Capture Compare Register value */
    TIMx->CCR3 = TIM_OCInitStruct->TIM_Pulse;

