FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Initializes the TIMx Channel4 according to the specified
 *         parameters in the TIM_OCInitStruct.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCInitStruct: pointer to a TIM_OCInitTypeDef structure
 *         that contains the configuration information for the specified TIM
 *         peripheral.
 * @retval None
 */
void TIM_OC4Init( TIM_TypeDef * TIMx,
                  TIM_OCInitTypeDef * TIM_OCInitStruct )
{
    uint16_t tmpccmrx = 0, tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_MODE( TIM_OCInitStruct->TIM_OCMode ) );
    assert_param( IS_TIM_OUTPUT_STATE( TIM_OCInitStruct->TIM_OutputState ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCInitStruct->TIM_OCPolarity ) );

    /* Disable the Channel 2: Reset the CC4E Bit */
    TIMx->CCER &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCER_CC4E ) );

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;

    /* Get the TIMx CCMR2 register value */
    tmpccmrx = TIMx->CCMR2;

    /* Reset the Output Compare Mode Bits */
    tmpccmrx &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCMR2_OC4M ) );

    /* Select the Output Compare Mode */
    tmpccmrx |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OCMode << 8 );

    /* Reset the Output Polarity level */
    tmpccer &= ( uint16_t ) ( ~( ( uint16_t ) TIM_CCER_CC4P ) );
    /* Set the Output Compare Polarity */
    tmpccer |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OCPolarity << 12 );

    /* Set the Output State */
    tmpccer |= ( uint16_t ) ( TIM_OCInitStruct->TIM_OutputState << 12 );

    /* Set the Capture Compare Register value */
    TIMx->CCR4 = TIM_OCInitStruct->TIM_Pulse;

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Fills each TIM_OCInitStruct member with its default value.
 * @param  TIM_OCInitStruct : pointer to a TIM_OCInitTypeDef structure which will
 *         be initialized.
 * @retval None
 */
void TIM_OCStructInit( TIM_OCInitTypeDef * TIM_OCInitStruct )
{
    /* Set the default configuration */
    TIM_OCInitStruct->TIM_OCMode = TIM_OCMode_Timing;
    TIM_OCInitStruct->TIM_OutputState = TIM_OutputState_Disable;
    TIM_OCInitStruct->TIM_Pulse = 0x0000;
    TIM_OCInitStruct->TIM_OCPolarity = TIM_OCPolarity_High;
}

/**
 * @brief  Selects the TIM Output Compare Mode.
 * @note   This function disables the selected channel before changing the Output
 *         Compare Mode.
 *         User has to enable this channel using TIM_CCxCmd and TIM_CCxNCmd functions.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_Channel: specifies the TIM Channel.
 *   This parameter can be one of the following values:
 *     @arg TIM_Channel_1: TIM Channel 1.
 *     @arg TIM_Channel_2: TIM Channel 2.
 *     @arg TIM_Channel_3: TIM Channel 3.
 *     @arg TIM_Channel_4: TIM Channel 4.
 * @param  TIM_OCMode: specifies the TIM Output Compare Mode.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCMode_Timing: TIM Output Compare Timing mode.
 *     @arg TIM_OCMode_Active: TIM Output Compare Active mode.
 *     @arg TIM_OCMode_Inactive: TIM Output Compare Inactive mode.
 *     @arg TIM_OCMode_Toggle: TIM Output Compare Toggle mode.
 *     @arg TIM_OCMode_PWM1: TIM Output Compare PWM1 mode.
 *     @arg TIM_OCMode_PWM2: TIM Output Compare PWM2 mode.
 *     @arg TIM_ForcedAction_Active: TIM Forced Action Active mode.
 *     @arg TIM_ForcedAction_InActive: TIM Forced Action Inactive mode.
 * @retval None
 */
void TIM_SelectOCxM( TIM_TypeDef * TIMx,
                     uint16_t TIM_Channel,
                     uint16_t TIM_OCMode )
{
    uint32_t tmp = 0;
    uint16_t tmp1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCM( TIM_OCMode ) );

    tmp = ( uint32_t ) TIMx;
    tmp += CCMR_OFFSET;

    tmp1 = CCER_CCE_SET << ( uint16_t ) TIM_Channel;

    /* Disable the Channel: Reset the CCxE Bit */
    TIMx->CCER &= ( uint16_t ) ~tmp1;

    if( ( TIM_Channel == TIM_Channel_1 ) || ( TIM_Channel == TIM_Channel_3 ) )
    {
        tmp += ( TIM_Channel >> 1 );

        /* Reset the OCxM bits in the CCMRx register */
        *( __IO uint32_t * ) tmp &= ( uint32_t ) ~( ( uint32_t ) TIM_CCMR1_OC1M );

        /* Configure the OCxM bits in the CCMRx register */
        *( __IO uint32_t * ) tmp |= TIM_OCMode;
    }
    else
    {
        tmp += ( uint16_t ) ( TIM_Channel - ( uint16_t ) 4 ) >> ( uint16_t ) 1;

        /* Reset the OCxM bits in the CCMRx register */
        *( __IO uint32_t * ) tmp &= ( uint32_t ) ~( ( uint32_t ) TIM_CCMR1_OC2M );

        /* Configure the OCxM bits in the CCMRx register */
        *( __IO uint32_t * ) tmp |= ( uint16_t ) ( TIM_OCMode << 8 );
    }
}

/**
 * @brief  Sets the TIMx Capture Compare1 Register value
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  Compare1: specifies the Capture Compare1 register new value.
 * @retval None
 */
void TIM_SetCompare1( TIM_TypeDef * TIMx,
                      uint32_t Compare1 )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );

    /* Set the Capture Compare1 Register value */
    TIMx->CCR1 = Compare1;
}

/**
 * @brief  Sets the TIMx Capture Compare2 Register value.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  Compare2: specifies the Capture Compare2 register new value.
 * @retval None
 */
void TIM_SetCompare2( TIM_TypeDef * TIMx,
                      uint32_t Compare2 )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );

    /* Set the Capture Compare2 Register value */
    TIMx->CCR2 = Compare2;
}

/**
 * @brief  Sets the TIMx Capture Compare3 Register value.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  Compare3: specifies the Capture Compare3 register new value.
 * @retval None
 */
void TIM_SetCompare3( TIM_TypeDef * TIMx,
                      uint32_t Compare3 )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );

    /* Set the Capture Compare3 Register value */
    TIMx->CCR3 = Compare3;
}

/**
 * @brief  Sets the TIMx Capture Compare4 Register value.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  Compare4: specifies the Capture Compare4 register new value.
 * @retval None
 */
void TIM_SetCompare4( TIM_TypeDef * TIMx,
                      uint32_t Compare4 )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );

