FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    /* Set the Capture Compare4 Register value */
    TIMx->CCR4 = Compare4;
}

/**
 * @brief  Forces the TIMx output 1 waveform to active or inactive level.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *   This parameter can be one of the following values:
 *     @arg TIM_ForcedAction_Active: Force active level on OC1REF.
 *     @arg TIM_ForcedAction_InActive: Force inactive level on OC1REF.
 * @retval None
 */
void TIM_ForcedOC1Config( TIM_TypeDef * TIMx,
                          uint16_t TIM_ForcedAction )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_FORCED_ACTION( TIM_ForcedAction ) );
    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC1M Bits */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC1M );
    /* Configure The Forced output Mode */
    tmpccmr1 |= TIM_ForcedAction;
    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Forces the TIMx output 2 waveform to active or inactive level.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM
 *   peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *   This parameter can be one of the following values:
 *     @arg TIM_ForcedAction_Active: Force active level on OC2REF.
 *     @arg TIM_ForcedAction_InActive: Force inactive level on OC2REF.
 * @retval None
 */
void TIM_ForcedOC2Config( TIM_TypeDef * TIMx,
                          uint16_t TIM_ForcedAction )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_FORCED_ACTION( TIM_ForcedAction ) );

    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC2M Bits */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC2M );
    /* Configure The Forced output Mode */
    tmpccmr1 |= ( uint16_t ) ( TIM_ForcedAction << 8 );
    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Forces the TIMx output 3 waveform to active or inactive level.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *   This parameter can be one of the following values:
 *     @arg TIM_ForcedAction_Active: Force active level on OC3REF.
 *     @arg TIM_ForcedAction_InActive: Force inactive level on OC3REF.
 * @retval None
 */
void TIM_ForcedOC3Config( TIM_TypeDef * TIMx,
                          uint16_t TIM_ForcedAction )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_FORCED_ACTION( TIM_ForcedAction ) );

    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC1M Bits */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC3M );
    /* Configure The Forced output Mode */
    tmpccmr2 |= TIM_ForcedAction;
    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Forces the TIMx output 4 waveform to active or inactive level.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_ForcedAction: specifies the forced Action to be set to the output waveform.
 *   This parameter can be one of the following values:
 *     @arg TIM_ForcedAction_Active: Force active level on OC4REF.
 *     @arg TIM_ForcedAction_InActive: Force inactive level on OC4REF.
 * @retval None
 */
void TIM_ForcedOC4Config( TIM_TypeDef * TIMx,
                          uint16_t TIM_ForcedAction )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_FORCED_ACTION( TIM_ForcedAction ) );

    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC2M Bits */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC4M );
    /* Configure The Forced output Mode */
    tmpccmr2 |= ( uint16_t ) ( TIM_ForcedAction << 8 );
    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR1.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPreload_Enable: Enable TIM output compare Preload
 *     @arg TIM_OCPreload_Disable: Disable TIM output compare Preload
 * @retval None
 */
void TIM_OC1PreloadConfig( TIM_TypeDef * TIMx,
                           uint16_t TIM_OCPreload )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCPRELOAD_STATE( TIM_OCPreload ) );

    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC1PE Bit */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC1PE );
    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr1 |= TIM_OCPreload;
    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR2.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPreload_Enable: Enable TIM output compare Preload
 *     @arg TIM_OCPreload_Disable: Disable TIM output compare Preload
 * @retval None
 */
void TIM_OC2PreloadConfig( TIM_TypeDef * TIMx,
                           uint16_t TIM_OCPreload )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCPRELOAD_STATE( TIM_OCPreload ) );

    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC2PE Bit */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC2PE );
    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr1 |= ( uint16_t ) ( TIM_OCPreload << 8 );
    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR3.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPreload_Enable: Enable TIM output compare Preload
 *     @arg TIM_OCPreload_Disable: Disable TIM output compare Preload
 * @retval None
 */
void TIM_OC3PreloadConfig( TIM_TypeDef * TIMx,
                           uint16_t TIM_OCPreload )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCPRELOAD_STATE( TIM_OCPreload ) );

    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC3PE Bit */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC3PE );
    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr2 |= TIM_OCPreload;
    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Enables or disables the TIMx peripheral Preload register on CCR4.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCPreload: new state of the TIMx peripheral Preload register.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPreload_Enable: Enable TIM output compare Preload
 *     @arg TIM_OCPreload_Disable: Disable TIM output compare Preload
 * @retval None
 */
void TIM_OC4PreloadConfig( TIM_TypeDef * TIMx,
                           uint16_t TIM_OCPreload )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCPRELOAD_STATE( TIM_OCPreload ) );

    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC4PE Bit */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC4PE );
    /* Enable or Disable the Output Compare Preload feature */
    tmpccmr2 |= ( uint16_t ) ( TIM_OCPreload << 8 );
    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Configures the TIMx Output Compare 1 Fast feature.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCFast_Enable: TIM output compare fast enable.
 *     @arg TIM_OCFast_Disable: TIM output compare fast disable.
 * @retval None
 */
void TIM_OC1FastConfig( TIM_TypeDef * TIMx,
                        uint16_t TIM_OCFast )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCFAST_STATE( TIM_OCFast ) );

    /* Get the TIMx CCMR1 register value */
    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC1FE Bit */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC1FE );
    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr1 |= TIM_OCFast;
    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Configures the TIMx Output Compare 2 Fast feature.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCFast_Enable: TIM output compare fast enable.
 *     @arg TIM_OCFast_Disable: TIM output compare fast disable.
 * @retval None
 */
void TIM_OC2FastConfig( TIM_TypeDef * TIMx,
                        uint16_t TIM_OCFast )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCFAST_STATE( TIM_OCFast ) );

    /* Get the TIMx CCMR1 register value */
    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC2FE Bit */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC2FE );
    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr1 |= ( uint16_t ) ( TIM_OCFast << 8 );
    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Configures the TIMx Output Compare 3 Fast feature.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCFast_Enable: TIM output compare fast enable.
 *     @arg TIM_OCFast_Disable: TIM output compare fast disable.
 * @retval None
 */
void TIM_OC3FastConfig( TIM_TypeDef * TIMx,
                        uint16_t TIM_OCFast )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCFAST_STATE( TIM_OCFast ) );

    /* Get the TIMx CCMR2 register value */
    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC3FE Bit */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC3FE );
    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr2 |= TIM_OCFast;
    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Configures the TIMx Output Compare 4 Fast feature.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCFast: new state of the Output Compare Fast Enable Bit.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCFast_Enable: TIM output compare fast enable.
 *     @arg TIM_OCFast_Disable: TIM output compare fast disable.
 * @retval None
 */
void TIM_OC4FastConfig( TIM_TypeDef * TIMx,
                        uint16_t TIM_OCFast )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCFAST_STATE( TIM_OCFast ) );

    /* Get the TIMx CCMR2 register value */
    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC4FE Bit */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC4FE );
    /* Enable or Disable the Output Compare Fast Bit */
    tmpccmr2 |= ( uint16_t ) ( TIM_OCFast << 8 );
    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Clears or safeguards the OCREF1 signal on an external event
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCClear_Enable: TIM Output clear enable.
 *     @arg TIM_OCClear_Disable: TIM Output clear disable.
 * @retval None
 */
void TIM_ClearOC1Ref( TIM_TypeDef * TIMx,
                      uint16_t TIM_OCClear )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCCLEAR_STATE( TIM_OCClear ) );

    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC1CE Bit */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC1CE );
    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr1 |= TIM_OCClear;
    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Clears or safeguards the OCREF2 signal on an external event
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *
 *   This parameter can be one of the following values:
 *     @arg TIM_OCClear_Enable: TIM Output clear enable.
 *     @arg TIM_OCClear_Disable: TIM Output clear disable .
 * @retval None
 */
void TIM_ClearOC2Ref( TIM_TypeDef * TIMx,
                      uint16_t TIM_OCClear )
{
    uint16_t tmpccmr1 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCCLEAR_STATE( TIM_OCClear ) );

    tmpccmr1 = TIMx->CCMR1;
    /* Reset the OC2CE Bit */
    tmpccmr1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_OC2CE );
    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr1 |= ( uint16_t ) ( TIM_OCClear << 8 );
    /* Write to TIMx CCMR1 register */
    TIMx->CCMR1 = tmpccmr1;
}

/**
 * @brief  Clears or safeguards the OCREF3 signal on an external event
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCClear_Enable: TIM Output clear enable.
 *     @arg TIM_OCClear_Disable: TIM Output clear disable.
 * @retval None
 */
void TIM_ClearOC3Ref( TIM_TypeDef * TIMx,
                      uint16_t TIM_OCClear )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCCLEAR_STATE( TIM_OCClear ) );

    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC3CE Bit */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC3CE );
    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr2 |= TIM_OCClear;
    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Clears or safeguards the OCREF4 signal on an external event
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCClear: new state of the Output Compare Clear Enable Bit.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCClear_Enable: TIM Output clear enable.
 *     @arg TIM_OCClear_Disable: TIM Output clear disable.
 * @retval None
 */
void TIM_ClearOC4Ref( TIM_TypeDef * TIMx,
                      uint16_t TIM_OCClear )
{
    uint16_t tmpccmr2 = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OCCLEAR_STATE( TIM_OCClear ) );

    tmpccmr2 = TIMx->CCMR2;
    /* Reset the OC4CE Bit */
    tmpccmr2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_OC4CE );
    /* Enable or Disable the Output Compare Clear Bit */
    tmpccmr2 |= ( uint16_t ) ( TIM_OCClear << 8 );
    /* Write to TIMx CCMR2 register */
    TIMx->CCMR2 = tmpccmr2;
}

/**
 * @brief  Configures the TIMx channel 1 polarity.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_OCPolarity: specifies the OC1 Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPolarity_High: Output Compare active high.
 *     @arg TIM_OCPolarity_Low: Output Compare active low.
 * @retval None
 */
void TIM_OC1PolarityConfig( TIM_TypeDef * TIMx,
                            uint16_t TIM_OCPolarity )
{
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCPolarity ) );

    tmpccer = TIMx->CCER;
    /* Set or Reset the CC1P Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC1P );
    tmpccer |= TIM_OCPolarity;
    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx channel 2 polarity.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_OCPolarity: specifies the OC2 Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPolarity_High: Output Compare active high.
 *     @arg TIM_OCPolarity_Low: Output Compare active low.
 * @retval None
 */
void TIM_OC2PolarityConfig( TIM_TypeDef * TIMx,
                            uint16_t TIM_OCPolarity )
{
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCPolarity ) );

    tmpccer = TIMx->CCER;
    /* Set or Reset the CC2P Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC2P );
    tmpccer |= ( uint16_t ) ( TIM_OCPolarity << 4 );
    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx channel 3 polarity.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCPolarity: specifies the OC3 Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPolarity_High: Output Compare active high.
 *     @arg TIM_OCPolarity_Low: Output Compare active low.
 * @retval None
 */
void TIM_OC3PolarityConfig( TIM_TypeDef * TIMx,
                            uint16_t TIM_OCPolarity )
{
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCPolarity ) );

    tmpccer = TIMx->CCER;
    /* Set or Reset the CC3P Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC3P );
    tmpccer |= ( uint16_t ) ( TIM_OCPolarity << 8 );
    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configures the TIMx channel 4 polarity.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCPolarity: specifies the OC4 Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCPolarity_High: Output Compare active high.
 *     @arg TIM_OCPolarity_Low: Output Compare active low.
 * @retval None
 */
void TIM_OC4PolarityConfig( TIM_TypeDef * TIMx,
                            uint16_t TIM_OCPolarity )
{
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_OC_POLARITY( TIM_OCPolarity ) );

    tmpccer = TIMx->CCER;
    /* Set or Reset the CC4P Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC4P );
    tmpccer |= ( uint16_t ) ( TIM_OCPolarity << 12 );
    /* Write to TIMx CCER register */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Selects the OCReference Clear source.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_OCReferenceClear: specifies the OCReference Clear source.
 *   This parameter can be one of the following values:
 *     @arg TIM_OCReferenceClear_ETRF: The internal OCreference clear input is connected to ETRF.
 *     @arg TIM_OCReferenceClear_OCREFCLR: The internal OCreference clear input is connected to OCREF_CLR input.
 * @retval None
 */
void TIM_SelectOCREFClear( TIM_TypeDef * TIMx,
                           uint16_t TIM_OCReferenceClear )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( TIM_OCREFERENCECECLEAR_SOURCE( TIM_OCReferenceClear ) );

    /* Set the TIM_OCReferenceClear source */
    TIMx->SMCR &= ( uint16_t ) ~( ( uint16_t ) TIM_SMCR_OCCS );
    TIMx->SMCR |= TIM_OCReferenceClear;
}

/**
 * @brief  Enables or disables the TIM Capture Compare Channel x.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_Channel: specifies the TIM Channel.
 *   This parameter can be one of the following values:
 *     @arg TIM_Channel_1: TIM Channel 1.
 *     @arg TIM_Channel_2: TIM Channel 2.
 *     @arg TIM_Channel_3: TIM Channel 3.
 *     @arg TIM_Channel_4: TIM Channel 4.
 * @param  TIM_CCx: specifies the TIM Channel CCxE bit new state.
 *   This parameter can be: TIM_CCx_Enable or TIM_CCx_Disable.
 * @retval None
 */
void TIM_CCxCmd( TIM_TypeDef * TIMx,
                 uint16_t TIM_Channel,
                 uint16_t TIM_CCx )
{
    uint16_t tmp = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_CCX( TIM_CCx ) );

    tmp = CCER_CCE_SET << TIM_Channel;

    /* Reset the CCxE Bit */
    TIMx->CCER &= ( uint16_t ) ~tmp;

    /* Set or reset the CCxE Bit */
    TIMx->CCER |= ( uint16_t ) ( TIM_CCx << TIM_Channel );
}

/**
 * @}
 */

