FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
/** @defgroup TIM_Group3 Input Capture management functions
 *  @brief    Input Capture management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Input Capture management functions #####
 #####===============================================================================
 #####
 *** TIM Driver: how to use it in Input Capture Mode ***
 ***===============================================================================
 ***[..] To use the Timer in Input Capture mode, the following steps are mandatory:
 ***     (#) Enable TIM clock using RCC_APBxPeriphClockCmd(RCC_APBxPeriph_TIMx, ENABLE)
 ***         function.
 ***     (#) Configure the TIM pins by configuring the corresponding GPIO pins.
 ***     (#) Configure the Time base unit as described in the first part of this
 ***         driver, if needed, else the Timer will run with the default configuration:
 ***         (++) Autoreload value = 0xFFFF.
 ***         (++) Prescaler value = 0x0000.
 ***         (++) Counter mode = Up counting.
 ***         (++) Clock Division = TIM_CKD_DIV1.
 ***     (#) Fill the TIM_ICInitStruct with the desired parameters including:
 ***         (++) TIM Channel: TIM_Channel.
 ***         (++) TIM Input Capture polarity: TIM_ICPolarity.
 ***         (++) TIM Input Capture selection: TIM_ICSelection.
 ***         (++) TIM Input Capture Prescaler: TIM_ICPrescaler.
 ***         (++) TIM Input CApture filter value: TIM_ICFilter.
 ***     (#) Call TIM_ICInit(TIMx, &TIM_ICInitStruct) to configure the desired
 ***         channel with the corresponding configuration and to measure only
 ***         frequency or duty cycle of the input signal,or, Call
 ***         TIM_PWMIConfig(TIMx, &TIM_ICInitStruct) to configure the desired
 ***         channels with the corresponding configuration and to measure the
 ***         frequency and the duty cycle of the input signal.
 ***     (#) Enable the NVIC or the DMA to read the measured frequency.
 ***     (#) Enable the corresponding interrupt (or DMA request) to read
 ***         the Captured value, using the function TIM_ITConfig(TIMx, TIM_IT_CCx)
 ***         (or TIM_DMA_Cmd(TIMx, TIM_DMA_CCx)).
 ***     (#) Call the TIM_Cmd(ENABLE) function to enable the TIM counter.
 ***     (#) Use TIM_GetCapturex(TIMx); to read the captured value.
 ***[..]
 ***    (@) All other functions can be used separately to modify, if needed,
 ***        a specific feature of the Timer.
 ***
 ***@endverbatim
 * @{
 */

/**
 * @brief  Initializes the TIM peripheral according to the specified
 *         parameters in the TIM_ICInitStruct.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_ICInitStruct: pointer to a TIM_ICInitTypeDef structure
 *         that contains the configuration information for the specified TIM
 *         peripheral.
 * @retval None
 */
void TIM_ICInit( TIM_TypeDef * TIMx,
                 TIM_ICInitTypeDef * TIM_ICInitStruct )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_IC_POLARITY( TIM_ICInitStruct->TIM_ICPolarity ) );
    assert_param( IS_TIM_IC_SELECTION( TIM_ICInitStruct->TIM_ICSelection ) );
    assert_param( IS_TIM_IC_PRESCALER( TIM_ICInitStruct->TIM_ICPrescaler ) );
    assert_param( IS_TIM_IC_FILTER( TIM_ICInitStruct->TIM_ICFilter ) );

    if( TIM_ICInitStruct->TIM_Channel == TIM_Channel_1 )
    {
        /* TI1 Configuration */
        TI1_Config( TIMx, TIM_ICInitStruct->TIM_ICPolarity,
                    TIM_ICInitStruct->TIM_ICSelection,
                    TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC1Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
    }
    else if( TIM_ICInitStruct->TIM_Channel == TIM_Channel_2 )
    {
        /* TI2 Configuration */
        assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
        TI2_Config( TIMx, TIM_ICInitStruct->TIM_ICPolarity,
                    TIM_ICInitStruct->TIM_ICSelection,
                    TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC2Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
    }
    else if( TIM_ICInitStruct->TIM_Channel == TIM_Channel_3 )
    {
        /* TI3 Configuration */
        assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
        TI3_Config( TIMx, TIM_ICInitStruct->TIM_ICPolarity,
                    TIM_ICInitStruct->TIM_ICSelection,
                    TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC3Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
    }
    else
    {
        /* TI4 Configuration */
        assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
        TI4_Config( TIMx, TIM_ICInitStruct->TIM_ICPolarity,
                    TIM_ICInitStruct->TIM_ICSelection,
                    TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC4Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
    }
}

/**
 * @brief  Fills each TIM_ICInitStruct member with its default value.
 * @param  TIM_ICInitStruct : pointer to a TIM_ICInitTypeDef structure which will
 *         be initialized.
 * @retval None
 */
void TIM_ICStructInit( TIM_ICInitTypeDef * TIM_ICInitStruct )
{
    /* Set the default configuration */
    TIM_ICInitStruct->TIM_Channel = TIM_Channel_1;
    TIM_ICInitStruct->TIM_ICPolarity = TIM_ICPolarity_Rising;
    TIM_ICInitStruct->TIM_ICSelection = TIM_ICSelection_DirectTI;
    TIM_ICInitStruct->TIM_ICPrescaler = TIM_ICPSC_DIV1;
    TIM_ICInitStruct->TIM_ICFilter = 0x00;
}

/**
 * @brief  Configures the TIM peripheral according to the specified
 *         parameters in the TIM_ICInitStruct to measure an external PWM signal.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_ICInitStruct: pointer to a TIM_ICInitTypeDef structure
 *         that contains the configuration information for the specified TIM
 *         peripheral.
 * @retval None
 */
void TIM_PWMIConfig( TIM_TypeDef * TIMx,
                     TIM_ICInitTypeDef * TIM_ICInitStruct )
{
    uint16_t icoppositepolarity = TIM_ICPolarity_Rising;
    uint16_t icoppositeselection = TIM_ICSelection_DirectTI;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );

    /* Select the Opposite Input Polarity */
    if( TIM_ICInitStruct->TIM_ICPolarity == TIM_ICPolarity_Rising )
    {
        icoppositepolarity = TIM_ICPolarity_Falling;
    }
    else
    {
        icoppositepolarity = TIM_ICPolarity_Rising;
    }

