FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    /* Select the Opposite Input */
    if( TIM_ICInitStruct->TIM_ICSelection == TIM_ICSelection_DirectTI )
    {
        icoppositeselection = TIM_ICSelection_IndirectTI;
    }
    else
    {
        icoppositeselection = TIM_ICSelection_DirectTI;
    }

    if( TIM_ICInitStruct->TIM_Channel == TIM_Channel_1 )
    {
        /* TI1 Configuration */
        TI1_Config( TIMx, TIM_ICInitStruct->TIM_ICPolarity, TIM_ICInitStruct->TIM_ICSelection,
                    TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC1Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
        /* TI2 Configuration */
        TI2_Config( TIMx, icoppositepolarity, icoppositeselection, TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC2Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
    }
    else
    {
        /* TI2 Configuration */
        TI2_Config( TIMx, TIM_ICInitStruct->TIM_ICPolarity, TIM_ICInitStruct->TIM_ICSelection,
                    TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC2Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
        /* TI1 Configuration */
        TI1_Config( TIMx, icoppositepolarity, icoppositeselection, TIM_ICInitStruct->TIM_ICFilter );
        /* Set the Input Capture Prescaler value */
        TIM_SetIC1Prescaler( TIMx, TIM_ICInitStruct->TIM_ICPrescaler );
    }
}

/**
 * @brief  Gets the TIMx Input Capture 1 value.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @retval Capture Compare 1 Register value.
 */
uint32_t TIM_GetCapture1( TIM_TypeDef * TIMx )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );

    /* Get the Capture 1 Register value */
    return TIMx->CCR1;
}

/**
 * @brief  Gets the TIMx Input Capture 2 value.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @retval Capture Compare 2 Register value.
 */
uint32_t TIM_GetCapture2( TIM_TypeDef * TIMx )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );

    /* Get the Capture 2 Register value */
    return TIMx->CCR2;
}

/**
 * @brief  Gets the TIMx Input Capture 3 value.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @retval Capture Compare 3 Register value.
 */
uint32_t TIM_GetCapture3( TIM_TypeDef * TIMx )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );

    /* Get the Capture 3 Register value */
    return TIMx->CCR3;
}

/**
 * @brief  Gets the TIMx Input Capture 4 value.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @retval Capture Compare 4 Register value.
 */
uint32_t TIM_GetCapture4( TIM_TypeDef * TIMx )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );

    /* Get the Capture 4 Register value */
    return TIMx->CCR4;
}

/**
 * @brief  Sets the TIMx Input Capture 1 prescaler.
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_ICPSC: specifies the Input Capture1 prescaler new value.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPSC_DIV1: no prescaler.
 *     @arg TIM_ICPSC_DIV2: capture is done once every 2 events.
 *     @arg TIM_ICPSC_DIV4: capture is done once every 4 events.
 *     @arg TIM_ICPSC_DIV8: capture is done once every 8 events.
 * @retval None
 */
void TIM_SetIC1Prescaler( TIM_TypeDef * TIMx,
                          uint16_t TIM_ICPSC )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_IC_PRESCALER( TIM_ICPSC ) );

    /* Reset the IC1PSC Bits */
    TIMx->CCMR1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_IC1PSC );
    /* Set the IC1PSC value */
    TIMx->CCMR1 |= TIM_ICPSC;
}

/**
 * @brief  Sets the TIMx Input Capture 2 prescaler.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_ICPSC: specifies the Input Capture2 prescaler new value.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPSC_DIV1: no prescaler.
 *     @arg TIM_ICPSC_DIV2: capture is done once every 2 events.
 *     @arg TIM_ICPSC_DIV4: capture is done once every 4 events.
 *     @arg TIM_ICPSC_DIV8: capture is done once every 8 events.
 * @retval None
 */
void TIM_SetIC2Prescaler( TIM_TypeDef * TIMx,
                          uint16_t TIM_ICPSC )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_IC_PRESCALER( TIM_ICPSC ) );

    /* Reset the IC2PSC Bits */
    TIMx->CCMR1 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_IC2PSC );
    /* Set the IC2PSC value */
    TIMx->CCMR1 |= ( uint16_t ) ( TIM_ICPSC << 8 );
}

/**
 * @brief  Sets the TIMx Input Capture 3 prescaler.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_ICPSC: specifies the Input Capture3 prescaler new value.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPSC_DIV1: no prescaler.
 *     @arg TIM_ICPSC_DIV2: capture is done once every 2 events.
 *     @arg TIM_ICPSC_DIV4: capture is done once every 4 events.
 *     @arg TIM_ICPSC_DIV8: capture is done once every 8 events.
 * @retval None
 */
void TIM_SetIC3Prescaler( TIM_TypeDef * TIMx,
                          uint16_t TIM_ICPSC )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_IC_PRESCALER( TIM_ICPSC ) );

    /* Reset the IC3PSC Bits */
    TIMx->CCMR2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_IC3PSC );
    /* Set the IC3PSC value */
    TIMx->CCMR2 |= TIM_ICPSC;
}

/**
 * @brief  Sets the TIMx Input Capture 4 prescaler.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_ICPSC: specifies the Input Capture4 prescaler new value.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPSC_DIV1: no prescaler.
 *     @arg TIM_ICPSC_DIV2: capture is done once every 2 events.
 *     @arg TIM_ICPSC_DIV4: capture is done once every 4 events.
 *     @arg TIM_ICPSC_DIV8: capture is done once every 8 events.
 * @retval None
 */
void TIM_SetIC4Prescaler( TIM_TypeDef * TIMx,
                          uint16_t TIM_ICPSC )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_IC_PRESCALER( TIM_ICPSC ) );

