FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    /* Reset the IC4PSC Bits */
    TIMx->CCMR2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_IC4PSC );
    /* Set the IC4PSC value */
    TIMx->CCMR2 |= ( uint16_t ) ( TIM_ICPSC << 8 );
}

/**
 * @}
 */

/** @defgroup TIM_Group4 Interrupts DMA and flags management functions
 *  @brief    Interrupts, DMA and flags management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Interrupts, DMA and flags management functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Enables or disables the specified TIM interrupts.
 * @param  TIMx: where x can be 2 to 11 to select the TIMx peripheral.
 * @param  TIM_IT: specifies the TIM interrupts sources to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg TIM_IT_Update: TIM update Interrupt source.
 *     @arg TIM_IT_CC1: TIM Capture Compare 1 Interrupt source.
 *     @arg TIM_IT_CC2: TIM Capture Compare 2 Interrupt source.
 *     @arg TIM_IT_CC3: TIM Capture Compare 3 Interrupt source.
 *     @arg TIM_IT_CC4: TIM Capture Compare 4 Interrupt source.
 *     @arg TIM_IT_Trigger: TIM Trigger Interrupt source.
 * @note TIM6 and TIM7 can only generate an update interrupt.
 * @note TIM_IT_CC2, TIM_IT_CC3, TIM_IT_CC4 and TIM_IT_Trigger can not be used with TIM10 and TIM11.
 * @note TIM_IT_CC3, TIM_IT_CC4 can not be used with TIM9.
 * @param  NewState: new state of the TIM interrupts.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_ITConfig( TIM_TypeDef * TIMx,
                   uint16_t TIM_IT,
                   FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_IT( TIM_IT ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Enable the Interrupt sources */
        TIMx->DIER |= TIM_IT;
    }
    else
    {
        /* Disable the Interrupt sources */
        TIMx->DIER &= ( uint16_t ) ~TIM_IT;
    }
}

/**
 * @brief  Configures the TIMx event to be generate by software.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_EventSource: specifies the event source.
 *   This parameter can be one or more of the following values:
 *     @arg TIM_EventSource_Update: Timer update Event source.
 *     @arg TIM_EventSource_CC1: Timer Capture Compare 1 Event source.
 *     @arg TIM_EventSource_CC2: Timer Capture Compare 2 Event source.
 *     @arg TIM_EventSource_CC3: Timer Capture Compare 3 Event source.
 *     @arg TIM_EventSource_CC4: Timer Capture Compare 4 Event source.
 *     @arg TIM_EventSource_Trigger: Timer Trigger Event source.
 * @note TIM6 and TIM7 can only generate an update event.
 * @note TIM9 can only generate an update event, Capture Compare 1 event,
 *     Capture Compare 2 event and TIM_EventSource_Trigger.
 * @note TIM10 and TIM11 can only generate an update event and Capture Compare 1 event.
 * @retval None
 */
void TIM_GenerateEvent( TIM_TypeDef * TIMx,
                        uint16_t TIM_EventSource )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_EVENT_SOURCE( TIM_EventSource ) );
    /* Set the event sources */
    TIMx->EGR = TIM_EventSource;
}

/**
 * @brief  Checks whether the specified TIM flag is set or not.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_FLAG: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg TIM_FLAG_Update: TIM update Flag.
 *     @arg TIM_FLAG_CC1: TIM Capture Compare 1 Flag.
 *     @arg TIM_FLAG_CC2: TIM Capture Compare 2 Flag.
 *     @arg TIM_FLAG_CC3: TIM Capture Compare 3 Flag.
 *     @arg TIM_FLAG_CC4: TIM Capture Compare 4 Flag.
 *     @arg TIM_FLAG_Trigger: TIM Trigger Flag.
 *     @arg TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag.
 *     @arg TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag.
 *     @arg TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag.
 *     @arg TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag.
 *
 * @note TIM6 and TIM7 can have only one update flag.
 * @note TIM9 can have only update flag, TIM_FLAG_CC1, TIM_FLAG_CC2 and TIM_FLAG_Trigger,
 *     TIM_FLAG_CC1OF or TIM_FLAG_CC2OF flags.
 * @note TIM10 and TIM11 can have only update flag, TIM_FLAG_CC1 or TIM_FLAG_CC1OF flags
 * @retval The new state of TIM_FLAG (SET or RESET).
 */
FlagStatus TIM_GetFlagStatus( TIM_TypeDef * TIMx,
                              uint16_t TIM_FLAG )
{
    ITStatus bitstatus = RESET;

    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_GET_FLAG( TIM_FLAG ) );

    if( ( TIMx->SR & TIM_FLAG ) != ( uint16_t ) RESET )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
 * @brief  Clears the TIMx's pending flags.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_FLAG: specifies the flag bit to clear.
 *   This parameter can be any combination of the following values:
 *     @arg TIM_FLAG_Update: TIM update Flag.
 *     @arg TIM_FLAG_CC1: TIM Capture Compare 1 Flag.
 *     @arg TIM_FLAG_CC2: TIM Capture Compare 2 Flag.
 *     @arg TIM_FLAG_CC3: TIM Capture Compare 3 Flag.
 *     @arg TIM_FLAG_CC4: TIM Capture Compare 4 Flag.
 *     @arg TIM_FLAG_Trigger: TIM Trigger Flag.
 *     @arg TIM_FLAG_CC1OF: TIM Capture Compare 1 overcapture Flag.
 *     @arg TIM_FLAG_CC2OF: TIM Capture Compare 2 overcapture Flag.
 *     @arg TIM_FLAG_CC3OF: TIM Capture Compare 3 overcapture Flag.
 *     @arg TIM_FLAG_CC4OF: TIM Capture Compare 4 overcapture Flag.
 * @note TIM6 and TIM7 can have only one update flag.
 * @note TIM9 can have only update flag, TIM_FLAG_CC1, TIM_FLAG_CC2 and TIM_FLAG_Trigger flags
 *     TIM_FLAG_CC1OF or TIM_FLAG_CC2OF flags.
 * @note TIM10 and TIM11 can have only update flag, TIM_FLAG_CC1
 *     or TIM_FLAG_CC1OF flags
 * @retval None
 */
void TIM_ClearFlag( TIM_TypeDef * TIMx,
                    uint16_t TIM_FLAG )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_CLEAR_FLAG( TIM_FLAG ) );

    /* Clear the flags */
    TIMx->SR = ( uint16_t ) ~TIM_FLAG;
}

/**
 * @brief  Checks whether the TIM interrupt has occurred or not.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_IT: specifies the TIM interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg TIM_IT_Update: TIM update Interrupt source.
 *     @arg TIM_IT_CC1: TIM Capture Compare 1 Interrupt source.
 *     @arg TIM_IT_CC2: TIM Capture Compare 2 Interrupt source.
 *     @arg TIM_IT_CC3: TIM Capture Compare 3 Interrupt source.
 *     @arg TIM_IT_CC4: TIM Capture Compare 4 Interrupt source.
 *     @arg TIM_IT_Trigger: TIM Trigger Interrupt source.
 *
 * @note TIM6 and TIM7 can generate only an update interrupt.
 * @note TIM9 can have only update interrupt, TIM_FLAG_CC1 or TIM_FLAG_CC2,
 *     interrupt and TIM_IT_Trigger interrupt.
 * @note TIM10 and TIM11 can have only update interrupt or TIM_FLAG_CC1
 *     interrupt
 * @retval The new state of the TIM_IT(SET or RESET).
 */
ITStatus TIM_GetITStatus( TIM_TypeDef * TIMx,
                          uint16_t TIM_IT )
{
    ITStatus bitstatus = RESET;
    uint16_t itstatus = 0x0, itenable = 0x0;

    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_GET_IT( TIM_IT ) );

