FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    itstatus = TIMx->SR & TIM_IT;

    itenable = TIMx->DIER & TIM_IT;

    if( ( itstatus != ( uint16_t ) RESET ) && ( itenable != ( uint16_t ) RESET ) )
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
 * @brief  Clears the TIMx's interrupt pending bits.
 * @param  TIMx: where x can be 2 to 11 to select the TIM peripheral.
 * @param  TIM_IT: specifies the pending bit to clear.
 *   This parameter can be any combination of the following values:
 *     @arg TIM_IT_Update: TIM update Interrupt source.
 *     @arg TIM_IT_CC1: TIM Capture Compare 1 Interrupt source.
 *     @arg TIM_IT_CC2: TIM Capture Compare 2 Interrupt source.
 *     @arg TIM_IT_CC3: TIM Capture Compare 3 Interrupt source.
 *     @arg TIM_IT_CC4: TIM Capture Compare 4 Interrupt source.
 *     @arg TIM_IT_Trigger: TIM Trigger Interrupt source.
 * @note
 * @note TIM6 and TIM7 can generate only an update interrupt.
 * @note TIM9 can have only update interrupt, TIM_IT_CC1 or TIM_IT_CC2,
 *     and TIM_IT_Trigger interrupt.
 * @note TIM10 and TIM11 can have only update interrupt or TIM_IT_CC1
 *     interrupt
 * @retval None
 */
void TIM_ClearITPendingBit( TIM_TypeDef * TIMx,
                            uint16_t TIM_IT )
{
    /* Check the parameters */
    assert_param( IS_TIM_ALL_PERIPH( TIMx ) );
    assert_param( IS_TIM_IT( TIM_IT ) );

    /* Clear the IT pending Bit */
    TIMx->SR = ( uint16_t ) ~TIM_IT;
}

/**
 * @brief  Configures the TIMx's DMA interface.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_DMABase: DMA Base address.
 *   This parameter can be one of the following values:
 *     @arg TIM_DMABase_CR1: TIM CR1 register as TIM DMA Base.
 *     @arg TIM_DMABase_CR2: TIM CR2 register as TIM DMA Base.
 *     @arg TIM_DMABase_SMCR: TIM SMCR register as TIM DMA Base.
 *     @arg TIM_DMABase_DIER: TIM DIER register as TIM DMA Base.
 *     @arg TIM_DMABase_SR: TIM SR register as TIM DMA Base.
 *     @arg TIM_DMABase_EGR: TIM EGR register as TIM DMA Base.
 *     @arg TIM_DMABase_CCMR1: TIM CCMR1 register as TIM DMA Base.
 *     @arg TIM_DMABase_CCMR2: TIM CCMR2 register as TIM DMA Base.
 *     @arg TIM_DMABase_CCER: TIM CCER register as TIM DMA Base.
 *     @arg TIM_DMABase_CNT: TIM CNT register as TIM DMA Base.
 *     @arg TIM_DMABase_PSC: TIM PSC register as TIM DMA Base.
 *     @arg TIM_DMABase_ARR: TIM ARR register as TIM DMA Base.
 *     @arg TIM_DMABase_CCR1: TIM CCR1 register as TIM DMA Base.
 *     @arg TIM_DMABase_CCR2: TIM CCR2 register as TIM DMA Base.
 *     @arg TIM_DMABase_CCR3: TIM CCR3 register as TIM DMA Base.
 *     @arg TIM_DMABase_CCR4: TIM CCR4 register as TIM DMA Base.
 *     @arg TIM_DMABase_DCR: TIM DCR register as TIM DMA Base.
 *     @arg TIM_DMABase_OR: TIM OR register as TIM DMA Base.
 * @param  TIM_DMABurstLength: DMA Burst length.
 *   This parameter can be one value between:
 *   TIM_DMABurstLength_1Transfer and TIM_DMABurstLength_18Transfers.
 * @retval None
 */
void TIM_DMAConfig( TIM_TypeDef * TIMx,
                    uint16_t TIM_DMABase,
                    uint16_t TIM_DMABurstLength )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_DMA_BASE( TIM_DMABase ) );
    assert_param( IS_TIM_DMA_LENGTH( TIM_DMABurstLength ) );
    /* Set the DMA Base and the DMA Burst Length */
    TIMx->DCR = TIM_DMABase | TIM_DMABurstLength;
}

/**
 * @brief  Enables or disables the TIMx's DMA Requests.
 * @param  TIMx: where x can be 2, 3, 4, 5, 6 or 7 to select the TIM peripheral.
 * @param  TIM_DMASource: specifies the DMA Request sources.
 *   This parameter can be any combination of the following values:
 *     @arg TIM_DMA_Update: TIM update Interrupt source.
 *     @arg TIM_DMA_CC1: TIM Capture Compare 1 DMA source.
 *     @arg TIM_DMA_CC2: TIM Capture Compare 2 DMA source.
 *     @arg TIM_DMA_CC3: TIM Capture Compare 3 DMA source.
 *     @arg TIM_DMA_CC4: TIM Capture Compare 4 DMA source.
 *     @arg TIM_DMA_Trigger: TIM Trigger DMA source.
 * @param  NewState: new state of the DMA Request sources.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_DMACmd( TIM_TypeDef * TIMx,
                 uint16_t TIM_DMASource,
                 FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST4_PERIPH( TIMx ) );
    assert_param( IS_TIM_DMA_SOURCE( TIM_DMASource ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Enable the DMA sources */
        TIMx->DIER |= TIM_DMASource;
    }
    else
    {
        /* Disable the DMA sources */
        TIMx->DIER &= ( uint16_t ) ~TIM_DMASource;
    }
}

/**
 * @brief  Selects the TIMx peripheral Capture Compare DMA source.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  NewState: new state of the Capture Compare DMA source
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_SelectCCDMA( TIM_TypeDef * TIMx,
                      FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Set the CCDS Bit */
        TIMx->CR2 |= TIM_CR2_CCDS;
    }
    else
    {
        /* Reset the CCDS Bit */
        TIMx->CR2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR2_CCDS );
    }
}

/**
 * @}
 */

/** @defgroup TIM_Group5 Clocks management functions
 *  @brief    Clocks management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Clocks management functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Configures the TIMx internal Clock
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @retval None
 */
void TIM_InternalClockConfig( TIM_TypeDef * TIMx )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    /* Disable slave mode to clock the prescaler directly with the internal clock */
    TIMx->SMCR &= ( uint16_t ) ( ~( ( uint16_t ) TIM_SMCR_SMS ) );
}

/**
 * @brief  Configures the TIMx Internal Trigger as External Clock
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_ITRSource: Trigger source.
 *   This parameter can be one of the following values:
 * @param  TIM_TS_ITR0: Internal Trigger 0.
 * @param  TIM_TS_ITR1: Internal Trigger 1.
 * @param  TIM_TS_ITR2: Internal Trigger 2.
 * @param  TIM_TS_ITR3: Internal Trigger 3.
 * @retval None
 */
void TIM_ITRxExternalClockConfig( TIM_TypeDef * TIMx,
                                  uint16_t TIM_InputTriggerSource )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_INTERNAL_TRIGGER_SELECTION( TIM_InputTriggerSource ) );
    /* Select the Internal Trigger */
    TIM_SelectInputTrigger( TIMx, TIM_InputTriggerSource );
    /* Select the External clock mode1 */
    TIMx->SMCR |= TIM_SlaveMode_External1;
}

/**
 * @brief  Configures the TIMx Trigger as External Clock
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_TIxExternalCLKSource: Trigger source.
 *   This parameter can be one of the following values:
 *     @arg TIM_TIxExternalCLK1Source_TI1ED: TI1 Edge Detector.
 *     @arg TIM_TIxExternalCLK1Source_TI1: Filtered Timer Input 1.
 *     @arg TIM_TIxExternalCLK1Source_TI2: Filtered Timer Input 2.
 * @param  TIM_ICPolarity: specifies the TIx Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPolarity_Rising:
 *     @arg TIM_ICPolarity_Falling:
 * @param  ICFilter : specifies the filter value.
 *   This parameter must be a value between 0x0 and 0xF.
 * @retval None
 */
void TIM_TIxExternalClockConfig( TIM_TypeDef * TIMx,
                                 uint16_t TIM_TIxExternalCLKSource,
                                 uint16_t TIM_ICPolarity,
                                 uint16_t ICFilter )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_IC_POLARITY( TIM_ICPolarity ) );
    assert_param( IS_TIM_IC_FILTER( ICFilter ) );

