FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    /* Configure the Timer Input Clock Source */
    if( TIM_TIxExternalCLKSource == TIM_TIxExternalCLK1Source_TI2 )
    {
        TI2_Config( TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter );
    }
    else
    {
        TI1_Config( TIMx, TIM_ICPolarity, TIM_ICSelection_DirectTI, ICFilter );
    }

    /* Select the Trigger source */
    TIM_SelectInputTrigger( TIMx, TIM_TIxExternalCLKSource );
    /* Select the External clock mode1 */
    TIMx->SMCR |= TIM_SlaveMode_External1;
}

/**
 * @brief  Configures the External clock Mode1
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
 *   This parameter can be one of the following values:
 *     @arg TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
 *     @arg TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
 *     @arg TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
 *     @arg TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
 * @param  TIM_ExtTRGPolarity: The external Trigger Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
 *     @arg TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
 * @param  ExtTRGFilter: External Trigger Filter.
 *   This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
void TIM_ETRClockMode1Config( TIM_TypeDef * TIMx,
                              uint16_t TIM_ExtTRGPrescaler,
                              uint16_t TIM_ExtTRGPolarity,
                              uint16_t ExtTRGFilter )
{
    uint16_t tmpsmcr = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_EXT_PRESCALER( TIM_ExtTRGPrescaler ) );
    assert_param( IS_TIM_EXT_POLARITY( TIM_ExtTRGPolarity ) );
    assert_param( IS_TIM_EXT_FILTER( ExtTRGFilter ) );

    /* Configure the ETR Clock source */
    TIM_ETRConfig( TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter );

    /* Get the TIMx SMCR register value */
    tmpsmcr = TIMx->SMCR;
    /* Reset the SMS Bits */
    tmpsmcr &= ( uint16_t ) ( ~( ( uint16_t ) TIM_SMCR_SMS ) );
    /* Select the External clock mode1 */
    tmpsmcr |= TIM_SlaveMode_External1;
    /* Select the Trigger selection : ETRF */
    tmpsmcr &= ( uint16_t ) ( ~( ( uint16_t ) TIM_SMCR_TS ) );
    tmpsmcr |= TIM_TS_ETRF;
    /* Write to TIMx SMCR */
    TIMx->SMCR = tmpsmcr;
}

/**
 * @brief  Configures the External clock Mode2
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
 *   This parameter can be one of the following values:
 *     @arg TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
 *     @arg TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
 *     @arg TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
 *     @arg TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
 * @param  TIM_ExtTRGPolarity: The external Trigger Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
 *     @arg TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
 * @param  ExtTRGFilter: External Trigger Filter.
 *   This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
void TIM_ETRClockMode2Config( TIM_TypeDef * TIMx,
                              uint16_t TIM_ExtTRGPrescaler,
                              uint16_t TIM_ExtTRGPolarity,
                              uint16_t ExtTRGFilter )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_EXT_PRESCALER( TIM_ExtTRGPrescaler ) );
    assert_param( IS_TIM_EXT_POLARITY( TIM_ExtTRGPolarity ) );
    assert_param( IS_TIM_EXT_FILTER( ExtTRGFilter ) );

    /* Configure the ETR Clock source */
    TIM_ETRConfig( TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter );
    /* Enable the External clock mode2 */
    TIMx->SMCR |= TIM_SMCR_ECE;
}

/**
 * @}
 */

/** @defgroup TIM_Group6 Synchronization management functions
 *  @brief    Synchronization management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Synchronization management functions #####
 #####===============================================================================
 *** TIM Driver: how to use it in synchronization Mode ***
 ***===============================================================================
 ***[..] Case of two/several Timers
 ***     (#) Configure the Master Timers using the following functions:
 ***         (++) void TIM_SelectOutputTrigger(TIM_TypeDef* TIMx,
 ***              uint16_t TIM_TRGOSource).
 ***         (++) void TIM_SelectMasterSlaveMode(TIM_TypeDef* TIMx,
 ***              uint16_t TIM_MasterSlaveMode);
 ***     (#) Configure the Slave Timers using the following functions:
 ***         (++) void TIM_SelectInputTrigger(TIM_TypeDef* TIMx,
 ***              uint16_t TIM_InputTriggerSource);
 ***         (++) void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode);
 ***[..] Case of Timers and external trigger(ETR pin)
 ***     (#) Configure the Etrenal trigger using this function:
 ***         (++) void TIM_ETRConfig(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler,
 ***              uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter);
 ***     (#) Configure the Slave Timers using the following functions:
 ***         (++) void TIM_SelectInputTrigger(TIM_TypeDef* TIMx,
 ***              uint16_t TIM_InputTriggerSource);
 ***         (++) void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode);
 ***
 ***@endverbatim
 * @{
 */

/**
 * @brief  Selects the Input Trigger source
 * @param  TIMx: where x can be 2, 3, 4, 5, or 9 to select the TIM peripheral.
 * @param  TIM_InputTriggerSource: The Input Trigger source.
 *   This parameter can be one of the following values:
 *     @arg TIM_TS_ITR0: Internal Trigger 0.
 *     @arg TIM_TS_ITR1: Internal Trigger 1.
 *     @arg TIM_TS_ITR2: Internal Trigger 2.
 *     @arg TIM_TS_ITR3: Internal Trigger 3.
 *     @arg TIM_TS_TI1F_ED: TI1 Edge Detector.
 *     @arg TIM_TS_TI1FP1: Filtered Timer Input 1.
 *     @arg TIM_TS_TI2FP2: Filtered Timer Input 2.
 *     @arg TIM_TS_ETRF: External Trigger input.
 * @retval None
 */
void TIM_SelectInputTrigger( TIM_TypeDef * TIMx,
                             uint16_t TIM_InputTriggerSource )
{
    uint16_t tmpsmcr = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_TRIGGER_SELECTION( TIM_InputTriggerSource ) );

    /* Get the TIMx SMCR register value */
    tmpsmcr = TIMx->SMCR;
    /* Reset the TS Bits */
    tmpsmcr &= ( uint16_t ) ( ~( ( uint16_t ) TIM_SMCR_TS ) );
    /* Set the Input Trigger source */
    tmpsmcr |= TIM_InputTriggerSource;
    /* Write to TIMx SMCR */
    TIMx->SMCR = tmpsmcr;
}

/**
 * @brief  Selects the TIMx Trigger Output Mode.
 * @param  TIMx: where x can be 2, 3, 4, 5, 6, 7 or 9 to select the TIM peripheral.
 * @param  TIM_TRGOSource: specifies the Trigger Output source.
 *   This paramter can be one of the following values:
 *
 *  @param For all TIMx
 *     @arg TIM_TRGOSource_Reset:  The UG bit in the TIM_EGR register is used as the trigger output (TRGO).
 *     @arg TIM_TRGOSource_Enable: The Counter Enable CEN is used as the trigger output (TRGO).
 *     @arg TIM_TRGOSource_Update: The update event is selected as the trigger output (TRGO).
 *
 *  @param For all TIMx except TIM6 and TIM7
 *     @arg TIM_TRGOSource_OC1: The trigger output sends a positive pulse when the CC1IF flag
 *                              is to be set, as soon as a capture or compare match occurs (TRGO).
 *     @arg TIM_TRGOSource_OC1Ref: OC1REF signal is used as the trigger output (TRGO).
 *
 *  @param For all TIMx except TIM6, TIM7, TIM10 and TIM11
 *     @arg TIM_TRGOSource_OC2Ref: OC2REF signal is used as the trigger output (TRGO).
 *
 *  @param For TIM2, TIM3 and TIM4
 *     @arg TIM_TRGOSource_OC3Ref: OC3REF signal is used as the trigger output (TRGO).
 *     @arg TIM_TRGOSource_OC4Ref: OC4REF signal is used as the trigger output (TRGO).
 *
 * @retval None
 */
void TIM_SelectOutputTrigger( TIM_TypeDef * TIMx,
                              uint16_t TIM_TRGOSource )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST5_PERIPH( TIMx ) );
    assert_param( IS_TIM_TRGO_SOURCE( TIM_TRGOSource ) );

    /* Reset the MMS Bits */
    TIMx->CR2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR2_MMS );
    /* Select the TRGO source */
    TIMx->CR2 |= TIM_TRGOSource;
}

/**
 * @brief  Selects the TIMx Slave Mode.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_SlaveMode: specifies the Timer Slave Mode.
 *   This paramter can be one of the following values:
 *     @arg TIM_SlaveMode_Reset: Rising edge of the selected trigger signal (TRGI) re-initializes
 *                               the counter and triggers an update of the registers.
 *     @arg TIM_SlaveMode_Gated:     The counter clock is enabled when the trigger signal (TRGI) is high.
 *     @arg TIM_SlaveMode_Trigger:   The counter starts at a rising edge of the trigger TRGI.
 *     @arg TIM_SlaveMode_External1: Rising edges of the selected trigger (TRGI) clock the counter.
 * @retval None
 */
void TIM_SelectSlaveMode( TIM_TypeDef * TIMx,
                          uint16_t TIM_SlaveMode )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_SLAVE_MODE( TIM_SlaveMode ) );

    /* Reset the SMS Bits */
    TIMx->SMCR &= ( uint16_t ) ~( ( uint16_t ) TIM_SMCR_SMS );
    /* Select the Slave Mode */
    TIMx->SMCR |= TIM_SlaveMode;
}

/**
 * @brief  Sets or Resets the TIMx Master/Slave Mode.
 * @param  TIMx: where x can be 2, 3, 4, 5 or 9 to select the TIM peripheral.
 * @param  TIM_MasterSlaveMode: specifies the Timer Master Slave Mode.
 *   This paramter can be one of the following values:
 *     @arg TIM_MasterSlaveMode_Enable: synchronization between the current timer
 *                                      and its slaves (through TRGO).
 *     @arg TIM_MasterSlaveMode_Disable: No action
 * @retval None
 */
void TIM_SelectMasterSlaveMode( TIM_TypeDef * TIMx,
                                uint16_t TIM_MasterSlaveMode )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST2_PERIPH( TIMx ) );
    assert_param( IS_TIM_MSM_STATE( TIM_MasterSlaveMode ) );

    /* Reset the MSM Bit */
    TIMx->SMCR &= ( uint16_t ) ~( ( uint16_t ) TIM_SMCR_MSM );

    /* Set or Reset the MSM Bit */
    TIMx->SMCR |= TIM_MasterSlaveMode;
}

/**
 * @brief  Configures the TIMx External Trigger (ETR).
 * @param  TIMx: where x can be 2, 3, 4, 5, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_ExtTRGPrescaler: The external Trigger Prescaler.
 *   This parameter can be one of the following values:
 *     @arg TIM_ExtTRGPSC_OFF: ETRP Prescaler OFF.
 *     @arg TIM_ExtTRGPSC_DIV2: ETRP frequency divided by 2.
 *     @arg TIM_ExtTRGPSC_DIV4: ETRP frequency divided by 4.
 *     @arg TIM_ExtTRGPSC_DIV8: ETRP frequency divided by 8.
 * @param  TIM_ExtTRGPolarity: The external Trigger Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ExtTRGPolarity_Inverted: active low or falling edge active.
 *     @arg TIM_ExtTRGPolarity_NonInverted: active high or rising edge active.
 * @param  ExtTRGFilter: External Trigger Filter.
 *   This parameter must be a value between 0x00 and 0x0F
 * @retval None
 */
void TIM_ETRConfig( TIM_TypeDef * TIMx,
                    uint16_t TIM_ExtTRGPrescaler,
                    uint16_t TIM_ExtTRGPolarity,
                    uint16_t ExtTRGFilter )
{
    uint16_t tmpsmcr = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST1_PERIPH( TIMx ) );
    assert_param( IS_TIM_EXT_PRESCALER( TIM_ExtTRGPrescaler ) );
    assert_param( IS_TIM_EXT_POLARITY( TIM_ExtTRGPolarity ) );
    assert_param( IS_TIM_EXT_FILTER( ExtTRGFilter ) );

