FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    tmpsmcr = TIMx->SMCR;
    /* Reset the ETR Bits */
    tmpsmcr &= SMCR_ETR_MASK;
    /* Set the Prescaler, the Filter value and the Polarity */
    tmpsmcr |= ( uint16_t ) ( TIM_ExtTRGPrescaler | ( uint16_t ) ( TIM_ExtTRGPolarity | ( uint16_t ) ( ExtTRGFilter << ( uint16_t ) 8 ) ) );
    /* Write to TIMx SMCR */
    TIMx->SMCR = tmpsmcr;
}

/**
 * @}
 */

/** @defgroup TIM_Group7 Specific interface management functions
 *  @brief    Specific interface management functions
 *
 * @verbatim
 * ===============================================================================
 ##### Specific interface management functions #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Configures the TIMx Encoder Interface.
 * @param  TIMx: where x can be  2, 3, 4 or 5 to select the TIM peripheral.
 * @param  TIM_EncoderMode: specifies the TIMx Encoder Mode.
 *   This parameter can be one of the following values:
 *     @arg TIM_EncoderMode_TI1: Counter counts on TI1FP1 edge depending on TI2FP2 level.
 *     @arg TIM_EncoderMode_TI2: Counter counts on TI2FP2 edge depending on TI1FP1 level.
 *     @arg TIM_EncoderMode_TI12: Counter counts on both TI1FP1 and TI2FP2 edges depending
 *                                on the level of the other input.
 * @param  TIM_IC1Polarity: specifies the IC1 Polarity.
 *   This parmeter can be one of the following values:
 *     @arg TIM_ICPolarity_Falling: IC Falling edge.
 *     @arg TIM_ICPolarity_Rising: IC Rising edge.
 * @param  TIM_IC2Polarity: specifies the IC2 Polarity
 *   This parmeter can be one of the following values:
 *     @arg TIM_ICPolarity_Falling: IC Falling edge.
 *     @arg TIM_ICPolarity_Rising: IC Rising edge.
 * @retval None
 */
void TIM_EncoderInterfaceConfig( TIM_TypeDef * TIMx,
                                 uint16_t TIM_EncoderMode,
                                 uint16_t TIM_IC1Polarity,
                                 uint16_t TIM_IC2Polarity )
{
    uint16_t tmpsmcr = 0;
    uint16_t tmpccmr1 = 0;
    uint16_t tmpccer = 0;

    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_TIM_ENCODER_MODE( TIM_EncoderMode ) );
    assert_param( IS_TIM_IC_POLARITY( TIM_IC1Polarity ) );
    assert_param( IS_TIM_IC_POLARITY( TIM_IC2Polarity ) );

    /* Get the TIMx SMCR register value */
    tmpsmcr = TIMx->SMCR;
    /* Get the TIMx CCMR1 register value */
    tmpccmr1 = TIMx->CCMR1;
    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;
    /* Set the encoder Mode */
    tmpsmcr &= ( uint16_t ) ( ~( ( uint16_t ) TIM_SMCR_SMS ) );
    tmpsmcr |= TIM_EncoderMode;
    /* Select the Capture Compare 1 and the Capture Compare 2 as input */
    tmpccmr1 &= ( uint16_t ) ( ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_CC1S ) ) & ( uint16_t ) ( ~( ( uint16_t ) TIM_CCMR1_CC2S ) ) );
    tmpccmr1 |= TIM_CCMR1_CC1S_0 | TIM_CCMR1_CC2S_0;
    /* Set the TI1 and the TI2 Polarities */
    tmpccer &= ( uint16_t ) ( ( ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC1P ) ) & ( ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC2P ) ) );
    tmpccer |= ( uint16_t ) ( TIM_IC1Polarity | ( uint16_t ) ( TIM_IC2Polarity << ( uint16_t ) 4 ) );
    /* Write to TIMx SMCR */
    TIMx->SMCR = tmpsmcr;
    /* Write to TIMx CCMR1 */
    TIMx->CCMR1 = tmpccmr1;
    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Enables or disables the TIMx's Hall sensor interface.
 * @param  TIMx: where x can be 2, 3, 4 or 5 to select the TIM peripheral.
 * @param  NewState: new state of the TIMx Hall sensor interface.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void TIM_SelectHallSensor( TIM_TypeDef * TIMx,
                           FunctionalState NewState )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST3_PERIPH( TIMx ) );
    assert_param( IS_FUNCTIONAL_STATE( NewState ) );

    if( NewState != DISABLE )
    {
        /* Set the TI1S Bit */
        TIMx->CR2 |= TIM_CR2_TI1S;
    }
    else
    {
        /* Reset the TI1S Bit */
        TIMx->CR2 &= ( uint16_t ) ~( ( uint16_t ) TIM_CR2_TI1S );
    }
}

/**
 * @}
 */

/** @defgroup TIM_Group8 Specific remapping management function
 *  @brief   Specific remapping management function
 *
 * @verbatim
 * ===============================================================================
 ##### Specific remapping management function #####
 #####===============================================================================
 #####
 #####@endverbatim
 * @{
 */

/**
 * @brief  Configures the TIM2, TIM3, TIM9, TIM10 and TIM11 Remapping input
 *         Capabilities.
 * @param  TIMx: where x can be 2, 3, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_Remap: specifies the TIM input remapping source.
 *   This parameter can be one of the following values:
 *     @arg TIM2_TIM10_OC: TIM2 ITR1 is connected to TIM10 output compare(default).
 *     @arg TIM2_TIM5_TRGO: TIM2 ITR1 is connected to TIM5 Trigger output.
 *     @arg TIM3_TIM11_OC: TIM3 ITR2 is connected to TIM11 output compare(default).
 *     @arg TIM3_TIM5_TRGO: TIM3 ITR2 is connected to TIM5 Trigger output.
 *     @arg TIM9_GPIO: TIM9 Channel 1 is connected to dedicated Timer pin(default).
 *     @arg TIM9_LSE: TIM9 Channel 1 is connected to LSE clock.
 *     @arg TIM9_TIM3_TRGO: TIM9 ITR1 is connected to TIM3 TRGO.
 *     @arg TIM9_TS_IO: TIM9 ITR1 is connected to Touch Sense IO.
 *     @arg TIM10_GPIO: TIM10 Channel 1 is connected to dedicated Timer pin(default).
 *     @arg TIM10_LSI: TIM10 Channel 1 is connected to LSI clock.
 *     @arg TIM10_LSE: TIM10 Channel 1 is connected to LSE clock.
 *     @arg TIM10_RTC: TIM10 Channel 1 is connected to RTC Output event.
 *     @arg TIM10_RI: TIM10 Channel 1 is connected to Routing Interface (RI).
 *     @arg TIM10_ETR_LSE: TIM10 ETR input is connected to LSE Clock.
 *     @arg TIM10_ETR_TIM9_TRGO: TIM10 ETR input is connected to TIM9 Trigger Output.
 *     @arg TIM11_GPIO: TIM11 Channel 1 is connected to dedicated Timer pin(default).
 *     @arg TIM11_MSI: TIM11 Channel 1 is connected to MSI clock.
 *     @arg TIM11_HSE_RTC: TIM11 Channel 1 is connected to HSE_RTC clock.
 *     @arg TIM11_RI: TIM11 Channel 1 is connected to Routing Interface (RI).
 *     @arg TIM11_ETR_LSE: TIM11 ETR input is connected to LSE Clock.
 *     @arg TIM11_ETR_TIM9_TRGO: TIM11 ETR input is connected to TIM9 Trigger Output.
 * @retval None
 */
void TIM_RemapConfig( TIM_TypeDef * TIMx,
                      uint32_t TIM_Remap )
{
    /* Check the parameters */
    assert_param( IS_TIM_LIST6_PERIPH( TIMx ) );
    assert_param( IS_TIM_REMAP( TIM_Remap ) );

    /* Set the Timer remapping configuration */
    TIMx->OR &= ( uint16_t ) ( TIM_Remap >> 16 );
    TIMx->OR |= ( uint16_t ) TIM_Remap;
}

/**
 * @}
 */

/**
 * @brief  Configure the TI1 as Input.
 * @param  TIMx: where x can be 2, 3, 4, 9, 10 or 11 to select the TIM peripheral.
 * @param  TIM_ICPolarity : The Input Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPolarity_Rising: IC Rising edge.
 *     @arg TIM_ICPolarity_Falling: IC Falling edge.
 * @param  TIM_ICSelection: specifies the input to be used.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICSelection_DirectTI: TIM Input 1 is selected to be connected to IC1.
 *     @arg TIM_ICSelection_IndirectTI: TIM Input 1 is selected to be connected to IC2.
 *     @arg TIM_ICSelection_TRC: TIM Input 1 is selected to be connected to TRC.
 * @param  TIM_ICFilter: Specifies the Input Capture Filter.
 *   This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
static void TI1_Config( TIM_TypeDef * TIMx,
                        uint16_t TIM_ICPolarity,
                        uint16_t TIM_ICSelection,
                        uint16_t TIM_ICFilter )
{
    uint16_t tmpccmr1 = 0, tmpccer = 0;

