FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_Discovery_IAR/ST_Code/Libraries/STM32L1xx_StdPeriph_Driver/src/stm32l1xx_tim.c
    /* Disable the Channel 1: Reset the CC1E Bit */
    TIMx->CCER &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC1E );
    tmpccmr1 = TIMx->CCMR1;
    tmpccer = TIMx->CCER;
    /* Select the Input and set the filter */
    tmpccmr1 &= ( uint16_t ) ( ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_CC1S ) ) & ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_IC1F ) ) );
    tmpccmr1 |= ( uint16_t ) ( TIM_ICSelection | ( uint16_t ) ( TIM_ICFilter << ( uint16_t ) 4 ) );
    /* Select the Polarity and set the CC1E Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) ( TIM_CCER_CC1P | TIM_CCER_CC1NP ) );
    tmpccer |= ( uint16_t ) ( TIM_ICPolarity | ( uint16_t ) TIM_CCER_CC1E );
    /* Write to TIMx CCMR1 and CCER registers */
    TIMx->CCMR1 = tmpccmr1;
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configure the TI2 as Input.
 * @param  TIMx: where x can be 2, 3, 4 or 9 to select the TIM peripheral.
 * @param  TIM_ICPolarity : The Input Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPolarity_Rising: IC Rising edge.
 *     @arg TIM_ICPolarity_Falling: IC Falling edge.
 * @param  TIM_ICSelection: specifies the input to be used.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICSelection_DirectTI: TIM Input 2 is selected to be connected to IC2.
 *     @arg TIM_ICSelection_IndirectTI: TIM Input 2 is selected to be connected to IC1.
 *     @arg TIM_ICSelection_TRC: TIM Input 2 is selected to be connected to TRC.
 * @param  TIM_ICFilter: Specifies the Input Capture Filter.
 *   This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
static void TI2_Config( TIM_TypeDef * TIMx,
                        uint16_t TIM_ICPolarity,
                        uint16_t TIM_ICSelection,
                        uint16_t TIM_ICFilter )
{
    uint16_t tmpccmr1 = 0, tmpccer = 0, tmp = 0;

    /* Disable the Channel 2: Reset the CC2E Bit */
    TIMx->CCER &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC2E );
    tmpccmr1 = TIMx->CCMR1;
    tmpccer = TIMx->CCER;
    tmp = ( uint16_t ) ( TIM_ICPolarity << 4 );
    /* Select the Input and set the filter */
    tmpccmr1 &= ( uint16_t ) ( ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_CC2S ) ) & ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR1_IC2F ) ) );
    tmpccmr1 |= ( uint16_t ) ( TIM_ICFilter << 12 );
    tmpccmr1 |= ( uint16_t ) ( TIM_ICSelection << 8 );
    /* Select the Polarity and set the CC2E Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) ( TIM_CCER_CC2P | TIM_CCER_CC2NP ) );
    tmpccer |= ( uint16_t ) ( tmp | ( uint16_t ) TIM_CCER_CC2E );
    /* Write to TIMx CCMR1 and CCER registers */
    TIMx->CCMR1 = tmpccmr1;
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configure the TI3 as Input.
 * @param  TIMx: where x can be 2, 3 or 4 to select the TIM peripheral.
 * @param  TIM_ICPolarity : The Input Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPolarity_Rising: IC Rising edge.
 *     @arg TIM_ICPolarity_Falling: IC Falling edge.
 * @param  TIM_ICSelection: specifies the input to be used.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICSelection_DirectTI: TIM Input 3 is selected to be connected to IC3.
 *     @arg TIM_ICSelection_IndirectTI: TIM Input 3 is selected to be connected to IC4.
 *     @arg TIM_ICSelection_TRC: TIM Input 3 is selected to be connected to TRC.
 * @param  TIM_ICFilter: Specifies the Input Capture Filter.
 *   This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
static void TI3_Config( TIM_TypeDef * TIMx,
                        uint16_t TIM_ICPolarity,
                        uint16_t TIM_ICSelection,
                        uint16_t TIM_ICFilter )
{
    uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

    /* Disable the Channel 3: Reset the CC3E Bit */
    TIMx->CCER &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC3E );
    tmpccmr2 = TIMx->CCMR2;
    tmpccer = TIMx->CCER;
    tmp = ( uint16_t ) ( TIM_ICPolarity << 8 );
    /* Select the Input and set the filter */
    tmpccmr2 &= ( uint16_t ) ( ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_CC3S ) ) & ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_IC3F ) ) );
    tmpccmr2 |= ( uint16_t ) ( TIM_ICSelection | ( uint16_t ) ( TIM_ICFilter << ( uint16_t ) 4 ) );
    /* Select the Polarity and set the CC3E Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) ( TIM_CCER_CC3P | TIM_CCER_CC3NP ) );
    tmpccer |= ( uint16_t ) ( tmp | ( uint16_t ) TIM_CCER_CC3E );
    /* Write to TIMx CCMR2 and CCER registers */
    TIMx->CCMR2 = tmpccmr2;
    TIMx->CCER = tmpccer;
}

/**
 * @brief  Configure the TI4 as Input.
 * @param  TIMx: where x can be 2, 3 or 4 to select the TIM peripheral.
 * @param  TIM_ICPolarity : The Input Polarity.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICPolarity_Rising: IC Rising edge.
 *     @arg TIM_ICPolarity_Falling: IC Falling edge.
 * @param  TIM_ICSelection: specifies the input to be used.
 *   This parameter can be one of the following values:
 *     @arg TIM_ICSelection_DirectTI: TIM Input 4 is selected to be connected to IC4.
 *     @arg TIM_ICSelection_IndirectTI: TIM Input 4 is selected to be connected to IC3.
 *     @arg TIM_ICSelection_TRC: TIM Input 4 is selected to be connected to TRC.
 * @param  TIM_ICFilter: Specifies the Input Capture Filter.
 *   This parameter must be a value between 0x00 and 0x0F.
 * @retval None
 */
static void TI4_Config( TIM_TypeDef * TIMx,
                        uint16_t TIM_ICPolarity,
                        uint16_t TIM_ICSelection,
                        uint16_t TIM_ICFilter )
{
    uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

    /* Disable the Channel 4: Reset the CC4E Bit */
    TIMx->CCER &= ( uint16_t ) ~( ( uint16_t ) TIM_CCER_CC4E );
    tmpccmr2 = TIMx->CCMR2;
    tmpccer = TIMx->CCER;
    tmp = ( uint16_t ) ( TIM_ICPolarity << 12 );
    /* Select the Input and set the filter */
    tmpccmr2 &= ( uint16_t ) ( ( uint16_t ) ( ~( uint16_t ) TIM_CCMR2_CC4S ) & ( ( uint16_t ) ~( ( uint16_t ) TIM_CCMR2_IC4F ) ) );
    tmpccmr2 |= ( uint16_t ) ( TIM_ICSelection << 8 );
    tmpccmr2 |= ( uint16_t ) ( TIM_ICFilter << 12 );

    /* Select the Polarity and set the CC4E Bit */
    tmpccer &= ( uint16_t ) ~( ( uint16_t ) ( TIM_CCER_CC4P | TIM_CCER_CC4NP ) );
    tmpccer |= ( uint16_t ) ( tmp | ( uint16_t ) TIM_CCER_CC4E );
    /* Write to TIMx CCMR2 and CCER registers */
    TIMx->CCMR2 = tmpccmr2;
    TIMx->CCER = tmpccer;
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
